# https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53

# specify a directory to install
cask_args appdir: '/Applications'

# Packages
brew 'powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'ffmpeg'

# Casks
## Browsers
cask 'google-chrome'
cask 'microsoft-edge'

## Utilities
cask 'rectangle'
cask 'alfred'
cask 'slack'
cask '1password'
cask 'iterm2'
cask 'hiddenbar'
cask 'josm'
cask 'visual-studio-code'
cask 'docker'

## Notion
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'